# 假设你知道了列表a中电影分别在2017-09-14(b_14)，2017-09-15(b_15),2017-09-16(b_16)三天的票房，
# 为了展示列表中电影本身的票房以及同其他电影的数据对比情况，应该如何更加直观的呈现该数据？
# a=[“猩球崛起3：终极之战"，“敦刻尔克"，“蜘蛛侠：英雄归来”，“战狼2"]
# b_16=[15746,312,4497,319]
# b_15=[12357,156,2045,168]
# b 14=[2358,399,2358,362]

from matplotlib import pyplot as plt

a = ["猩球崛起3：终极之战", "敦刻尔克", "蜘蛛侠：英雄归来", "战狼2"]
b_16 = [15746, 312, 4497, 319]
b_15 = [12357, 156, 2045, 168]
b_14 = [2358, 399, 2358, 362]

x_labels = a * 3
x_positions = [i for i in range(len(x_labels))]
y_values = b_14 + b_15 + b_16

plt.figure(figsize=(20, 8), dpi=80)
plt.bar(x_positions, y_values, width=0.2)
plt.xticks(x_positions, x_labels)

plt.show()

# 错误提示：当您在绘制数据的图表时，通常需要指定 x 轴刻度列表。x 轴刻度列表是一个包含所有要显示在 x 轴上的标签或数值的列表。
# 如果您提供的数据列表和 x 轴刻度列表长度不匹配，则会出现 "数据列表长度与 x 轴刻度列表长度不匹配" 的错误。
